:PROPERTIES:
:ID:       50ee18c7-70b4-42e2-b650-d4303f4dd049
:END:
#+SETUPFILE: blog.setup
#+filetags: :events:aws:
#+TITLE: AWS Summit 2023 in Berlin
#+CREATED: 2023-05-04
#+HUGO_DRAFT: true

**** For ~BTC~:
- blocks/date={YYYY-MM-DD}/{id}.snappy.parquet
- transactions/date={YYYY-MM-DD}/{id}.snappy.parquet

#+begin_src sh
aws s3 ls --no-sign-request s3://aws-public-blockchain/v1.0/btc/
#+end_src

#+RESULTS:
| PRE | blocks/       |
| PRE | transactions/ |

**** For *ETH*
- blocks/date={YYYY-MM-DD}/{id}.snappy.parquet
- transactions /date={YYYY-MM-DD}/{id}.snappy.parquet
- logs/date={YYYY-MM-DD}/{id}.snappy.parquet
- token_transfers/date={YYYY-MM-DD}/{id}.snappy.parquet
- traces/date={YYYY-MM-DD}/{id}.snappy.parquet
- contracts/date={YYYY-MM-DD}/{id}.snappy.parquet

#+begin_src sh
aws s3 ls --no-sign-request s3://aws-public-blockchain/v1.0/eth/
#+end_src

#+RESULTS:
| PRE | blocks/          |
| PRE | contracts/       |
| PRE | logs/            |
| PRE | token_transfers/ |
| PRE | traces/          |
| PRE | transactions/    |

#+begin_src sh
aws s3 ls --no-sign-request s3://aws-public-blockchain/v1.0/eth/transactions/date=2023-05-04/
#+end_src

Some example:

#+caption: How to get transaction metadata
#+begin_example
aws s3 ls --no-sign-request s3://aws-public-blockchain/v1.0/btc/transactions/2023-05-08/4ed1639d0b03a562def6755a0c0465a11248c04cd389ea09cf87a35f6c95b6f9.snappy.parquet
#+end_example

